# AnalyticalModelManuallyAdjusted Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelManuallyAdjusted Property
ParameterTypeId Class See Also
---
"Manually Adjusted"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelManuallyAdjusted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelManuallyAdjusted As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelManuallyAdjusted {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace